[
    {
        "name": "Rolling Glory",
        "time": "January 2023 - Present",
        "position": "Mobile Engineer",
        "type": "Fulltime",
        "description": "As a Mobile Engineer since January 2023, I have significantly improved team productivity through the development of a custom Flutter Linter and libraries. I have consistently delivered high-value mobile development projects within deadlines, resulting in exceptional client retention. By employing clean architecture and Test-Driven Development, I have notably reduced bug reports. Additionally, I have enhanced user engagement by integrating sophisticated functionalities, such as personalized product recommendations and in-app marketing tools."
    },
    {
        "name": "Bangkit Academy led by Google, GoTo, & Traveloka",
        "time": "February 2024 - Present",
        "position": "Mobile Development Mentor",
        "type": "Freelance",
        "description": "As a Mentor, I am responsible for teaching and providing support to enhance mentee learning. I achieved top mentor status by offering actionable feedback and guidance, earning a score of 4.92/5.00 from 25 mentees over 6 months. I facilitated their professional growth, enabling them to complete courses and final projects 3 weeks ahead of schedule. I coached a mentee in advanced coding techniques and contributed to Bangkit’s all-time high graduation rate of 93%."
    },
    {
        "name": "Area Berkarya Abadi",
        "time": "January 2024 - Present",
        "position": "Mobile Engineer",
        "type": "Fulltime",
        "description": "I led the development and enhancement of mobile applications for three projects, achieving notable performance improvements. I optimized operational efficiency by developing and deploying features like face recognition, Bluetooth integration, and geo-fencing, which enhanced payroll management and attendance functionalities. I implemented Golang best practices and frameworks such as Gin and Gorm, improving database operations and reducing query response times. I deployed a tourism app using Flutter with offline caching, which reduced data usage and improved accessibility in remote areas."
    },
    {
        "name": "PT Global Data Inspirasi",
        "time": "August 2023 - January 2024",
        "position": "Computer Vision Engineer",
        "type": "Internship",
        "description": "At Genio Video CCTV, I was responsible for maintaining and enhancing code quality. I implemented features to detect vehicles in real-time from CCTV in Yogyakarta and integrated a stacked bar chart. Additionally, I focused on reducing delays and improving overall performance. In the Proctoring App project, I developed a multi-platform application using Flutter and successfully integrated face recognition technology."
    },
    {
        "name": "Bangkit Academy led by Google, GoTo, & Traveloka",
        "time": "February 2023 - July 2023",
        "position": "Android Developer Mentee",
        "type": "Apprenticeship",
        "description": "Bangkit is a unique career readiness program led by Google and delivered with support from industry experts from their industry partner like GoTo, Traveloka, and Deeptech Foundation. The program is designed to provide participants with first-hand exposure to real-world practitioners and prepare them with relevant skills for a successful career in leading tech companies. I am successfully selected to be 3,100 participants from 67,000 registrants as Mobile Developer (Android) Trainees and graduated as Certified Android Developer."
    },
    {
        "name": "MoGawe",
        "time": "September 2021 - December 2022",
        "position": "Android Developer",
        "type": "Fulltime",
        "description": "Increased the user base and reduced development costs by proposing and leading the initiative to rebuild the MoGawe App using Flutter with clean architecture for multi-platform deployment. Boosted development efficiency and minimized bug-related tickets by developing a new app architecture and standardized coding conventions. Enhanced data entry efficiency and accuracy by designing an advanced form with OCR integration, eliminating manual data entry tasks. I ensured smooth app performance by analyzing and fixing critical memory leaks that caused crashes on low-end devices, preventing potential negative app store reviews."
    }
]
